performance-test-reports/publish-mobile-n-load-test-report/12532220483/1/user-registration/user_registration/run.log
-    █ [Create Account Service]

-      █ should be able to register new user successfully

-        ✓ is status 200
-        ✓ response body
-        ✓ expected status to equal 200
-        ✓ expected user registration api response to equal 'User Registered'

-    checks.........................: 100.00% ✓ 2400     ✗ 0    
-    data_received..................: 115 kB  1.9 kB/s
-    data_sent......................: 169 kB  2.8 kB/s
-    group_duration.................: avg=10.31ms  min=3.04ms   med=3.41ms   max=837.56ms p(90)=3.84ms   p(95)=4.31ms  
-    http_req_blocked...............: avg=173.69µs min=123.73µs med=167.93µs max=546.05µs p(90)=210.06µs p(95)=224.07µs
-    http_req_connecting............: avg=125.81µs min=88.01µs  med=121.19µs max=488.57µs p(90)=151.77µs p(95)=163.48µs
-  ✓ http_req_duration..............: avg=9.34ms   min=2.14ms   med=2.46ms   max=836.41ms p(90)=2.8ms    p(95)=3.22ms  
-      { expected_response:true }...: avg=9.34ms   min=2.14ms   med=2.46ms   max=836.41ms p(90)=2.8ms    p(95)=3.22ms  
-  ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 600  
-    http_req_receiving.............: avg=64.48µs  min=36.74µs  med=66.69µs  max=157.25µs p(90)=82.16µs  p(95)=88.42µs 
-    http_req_sending...............: avg=38.43µs  min=17.79µs  med=36.69µs  max=244.8µs  p(90)=52.17µs  p(95)=58.92µs 
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=9.24ms   min=2.03ms   med=2.37ms   max=836.34ms p(90)=2.7ms    p(95)=3.13ms  
-    http_reqs......................: 600     9.998831/s
-    iteration_duration.............: avg=10.35ms  min=3.1ms    med=3.46ms   max=837.6ms  p(90)=3.89ms   p(95)=4.38ms  
-    iterations.....................: 600     9.998831/s
-    vus............................: 0       min=0      max=6  
-    vus_max........................: 200     min=200    max=200